{
  "type": "project",
  "case": "page",
  "content": {
    "title": "Development Workflow Process",
    "format": true,
    "content": [
      {
        "id": 1,
        "type": "note",
        "paragraph": "This section is designed to help the developer understand TLH development workflows and protocols."
      },
      {
        "id": 1,
        "type": "note",
        "paragraph": "For information about the Beanstalk Workflow process, refer to the confluence document <a href=\"https://altitude-sports.atlassian.net/wiki/display/AS/BEANSTALK+WORKFLOW+PROCESSES\" target=\"_blank\">here</a>"
      },
      {
        "id":2,
        "type":"header",
        "paragraph":"Development Environments"
      },
      {
        "id": 1,
        "type": "text",
        "paragraph": "<p>There are two development websites. The DEV server must be kept up to date with any changes made in the production environment. Any new functions, scripts or features must be tested in dev before being pushed to preprod and eventually prod.</p><p>DEV   https://ldc-dev.myshopify.com.<br />DEV PLAN B  https://dernierechasse.myshopify.com.</p><p>Acces admin (/admin/) and access settings configs via online store > themes section.</p><p>Updates must be made manually to ensure that all environments are mirror copies of each other. If changes are made in dev, they must be exported as a new theme and then imported into the other environments. Once testing has been completed on the pre-prod theme, that theme can be activated and pushed into production.</p><p><em>See below for lines to add to your hosts file to access the sites via a common url</em></p>"
      },

      {
        "id": 1,
        "type": "note",
        "paragraph": "The dev server is not a shopify plus account and may, on rare occurrences, react somewhat differently."
      },
      {
        "id": 1,
        "type": "note",
        "paragraph": "When making large changes to any aspect of the theme, it is important to duplicate the theme and use it as the new working development environment. If a revert is required, simply reactivate the last working theme."
      },
      {
        "id":3,
        "type":"header",
        "paragraph":"Pre-production Environments & Theme Repositories"
      },
      {
        "id": 1,
        "type": "text",
        "paragraph": "<p>Pre-production environment refers to non active themes on the production server that can be tested and validated prior to be published and pushed live. All themes reside in the theme repository and should be named to identify the latest working theme, the pre-production theme and the currently working theme (i.e version number, an explicit title \"current\", \"working\", \"mnew_feature\"...). Only very minor, non breaking changes should be applied to live theme items.</p><p>The pre-production theme repository has the same address as the production server (https://lasthunt.myshopify.com/admin)</p>"
      },
      {
        "id":12,
        "type":"warning",
        "paragraph":"Do not make any changes to the config file in the live environment. All config changes MUST go through a full test in dev before being pushed live. Config files are versioned."
      },
      {
        "id":4,
        "type":"header",
        "paragraph":"Production Environments"
      },
      {
        "id": 1,
        "type": "text",
        "paragraph": "<p>The production environment refers to the live and theme repository environment. Avoid making major changes to the production environment unless a hot fix is necessary or minor style fixes must be made.</p><p>Any changes made to the live environment should be mirrored onto the dev and pre-prod environments.</p>"
      },
      {
        "id":5,
        "type":"header",
        "paragraph":"Shopify Specifics"
      },
      {
        "id": 1,
        "type": "text",
        "paragraph": "<p>Image repositories are the same no matter what environment the image is uploaded to. The CDN link will remain the same and doesn't need to be changed.</p><p>Shopify requires all links to be schemaless (i.e. //www.mydomain.com/)</p><p>JS, SCSS and CSS files in the Assets folder are not versioned</p><p>Ensure JS and SCSS .liquid file extension (i.e. app.js.liquid...) in order to use liquid variables within them</p>"
      }
    ]
  }
}